## Importing libraries

In [1]:
import pandas as pd
from sqlite3 import connect

In [2]:
connection = connect("library.db")

## SQL scripts

01) Write a sql query to get books that has rate >=3 and has 'Mr' in its name

In [3]:
one = connection.execute("SELECT * FROM books where book_name like 'Mr%' and rates >=3 ").fetchall()
one

[(221, 'Mrs. Houdini', 5, 30.25), (1089, 'Mrs. Houdini', 5, 30.25)]

02) Write a sql query to get books that has rate >=3 or price > 20.

In [4]:
two = connection.execute("SELECT * FROM books WHERE rates >=3 OR price >20").fetchall()
len(two)

1544

03) Write a sql query to get books that has rate not 3.

In [5]:
three = connection.execute("SELECT * FROM books WHERE rates IS NOT 3").fetchall()
len(three)

811

04) Write a sql query to get books that has price between 10 and 40 and has rate 3 or 4 or 1

In [6]:
four = connection.execute("SELECT * FROM books WHERE price BETWEEN 10 AND 40 AND rates = 3 or 4 or 1 ").fetchall()
len(four)

1544

05) Write a sql query to get the top 5 most expensive books (order books desc with price column and then limit the result to the first 5)

In [7]:
connection.execute("SELECT book_name, price FROM books where price <= 59.99 order by price desc limit 5").fetchall()

[('The Perfect Play (Play by Play #1)', 59.99),
 ('The Perfect Play (Play by Play #1)', 59.99),
 ('Last One Home (New Beginnings #1)', 59.98),
 ('Last One Home (New Beginnings #1)', 59.98),
 ('The Barefoot Contessa Cookbook', 59.92)]

06) Write a sql query to get the 3rd 10 books in the books table order first by rate desc and then by price asc.

In [8]:
six = connection.execute("SELECT * FROM books WHERE rates = 3 ORDER BY rates DESC, price ASC LIMIT 10").fetchall()
six

[(680, 'An Abundance of Katherines', 3, 10),
 (1823, 'An Abundance of Katherines', 3, 10),
 (543, 'The Origin of Species', 3, 10.01),
 (1846, 'The Origin of Species', 3, 10.01),
 (758,
  'The Tipping Point: How Little Things Can Make a Big Difference',
  3,
  10.02),
 (1708,
  'The Tipping Point: How Little Things Can Make a Big Difference',
  3,
  10.02),
 (126, 'Patience', 3, 10.16),
 (1119, 'Patience', 3, 10.16),
 (344, 'Greek Mythic History', 3, 10.23),
 (1539, 'Greek Mythic History', 3, 10.23)]

07) Write a sql query to add a new category in categories table and add 5 books to this category in books table with title, rate and price.

In [ ]:
for _ in range(5):
    
    name = input("type in title of the book")
    rate = int(input("rate books"))
    price = float(input("pricing the book"))
    new_cat = input("type in the name of new category")

    insert_int_books_table = connection.execute("INSERT INTO books (book_name, rates, price) values (?, ?, ?)",
                                                [name,rate,price])
    connection.commit()
    
    
    book_id = connection.execute("SELECT book_id from books").fetchall()[-1][0]
    insert_int_category_table = connection.execute("INSERT INTO categories (category, book_id) values (?, ?)",
                                                   [new_cat,book_id])
    connection.commit()

08) Write a sql query to update book's rate to 3 that thier price < 20£.

In [9]:
connection.execute("UPDATE books set rates = 3 WHERE price < 20")
connection.commit()

09) Write a sql query to delete all books that have price > 50£ and has rate <= 2.

In [10]:
connection.execute("DELETE FROM books WHERE price >50 and rates <= 2")
connection.commit()

10) Write a sql query to count the number of books that have 'Secret' in thier names and price between 10£ and 25£

In [11]:
connection.execute("SELECT count(book_name) FROM books where book_name like '%Secret%' AND price BETWEEN 10 AND 25").fetchall()
# [(10,)] means 10 books

[(10,)]

11) Write a sql query to get the minimum & maximum price for all the books that have rate 5.

In [12]:
connection.execute("SELECT min(price) as mimimum, max(price) as maximum FROM books WHERE rates = 5").fetchall()[0]

(20.02, 59.92)

12) Write a sql query to calculate the avg price for all the books that have rate 5

In [13]:
connection.execute("SELECT avg(price) FROM books WHERE rates = 5").fetchall()[0][0]

41.03433962264149

13) Write a sql query to sum all book's price that have rate 2 and price between 10 and 40

In [14]:
connection.execute("SELECT sum(price) FROM books WHERE rates = 2 and (price between 10 and 40) ").fetchall()[0][0]

2017.1000000000008

14) Write a sql query to join both books & categories table into one new table containing book_name & category_name & book_rate and book_price.

**Notes: full outer joins and right join are currently an avaliable**
* type right or full outer join it will produce an immediate errors

In [15]:
left_join_books = connection.execute("""SELECT B.book_name, B.rates, B.price, 
C.category FROM books B left join categories C on B.book_id = C.book_id""").fetchall()

len(left_join_books)

1544

15) Write a sql query to calculate how many books each rate has and have price between 20£ and 30£.

In [16]:
connection.execute("SELECT count(rates), rates FROM books group by rates HAVING price BETWEEN 20 AND 30").fetchall()
# counting rates of each class, the most rates had price between 20 and 30
# [(countin books, rate 1), (counting books, rates 2)] all had price between 20 and 30

[(114, 1), (80, 2)]

16) Write a sql query to calculate how many books each category has having count > 10.

In [17]:
connection.execute("SELECT count(category) as count_cat, category FROM categories group by category HAVING count_cat > 10").fetchall()

[(67, 'Add a comment'),
 (40, 'All products'),
 (1000, 'Books'),
 (12, 'Business'),
 (29, 'Childrens'),
 (19, 'Classics'),
 (152, 'Default'),
 (48, 'Fantasy'),
 (65, 'Fiction'),
 (30, 'Food and Drink'),
 (26, 'Historical Fiction'),
 (18, 'History'),
 (17, 'Horror'),
 (13, 'Music'),
 (32, 'Mystery'),
 (110, 'Nonfiction'),
 (11, 'Philosophy'),
 (19, 'Poetry'),
 (35, 'Romance'),
 (14, 'Science'),
 (16, 'Science Fiction'),
 (75, 'Sequential Art'),
 (11, 'Thriller'),
 (11, 'Travel'),
 (17, 'Womens Fiction'),
 (54, 'Young Adult')]

17) Write a sql query to get all books with category_name='Music' using subquery.

In [18]:
connection.execute("""SELECT book_name FROM books 
WHERE book_id in (SELECT book_id FROM categories WHERE category = 'Music' )""").fetchall()

[('Rip it Up and Start Again',),
 ('Our Band Could Be Your Life: Scenes from the American Indie Underground, 1981-1991',),
 ('Love Is a Mix Tape (Music #1)',),
 ('Please Kill Me: The Uncensored Oral History of Punk',),
 ("Kill 'Em and Leave: Searching for James Brown and the American Soul",),
 ('Orchestra of Exiles: The Story of Bronislaw Huberman, the Israel Philharmonic, and the One Thousand Jews He Saved from Nazi Horrors',),
 ('No One Here Gets Out Alive',),
 ('Life',),
 ('Forever Rockers (The Rocker #12)',)]

## Reading SQL using pandas

In [38]:
book_dataframe = pd.read_sql('SELECT * FROM books', connection)
category_dataframe = pd.read_sql("SELECT * FROM categories", connection)

In [39]:
book_dataframe.head(2)

   book_id             book_name  rates  price
0        2  A Light in the Attic      3  51.77
1        5         Sharp Objects      4  47.82

In [40]:
category_dataframe.head(2)

   categ_id      category  book_id
0         2  All products        2
1         3  All products        3

## Reading an Exported csv file using Pandas

In [47]:
book_df = pd.read_csv(r"Export_to_CSV\books.csv")
book_df.head(2)

   book_id             book_name  rates  price
0        2  A Light in the Attic      3  51.77
1        3    Tipping the Velvet      1  53.74

In [49]:
cat_df = pd.read_csv(r"Export_to_CSV\categories.csv")
cat_df.head(2)

   categ_id      category  book_id
0         2  All products        2
1         3  All products        3

## Reading rows sequence

In [113]:
sequence = pd.read_csv(r"Export_to_CSV\sqlite_sequence.csv")
sequence.head()

         name   seq
0       books  2041
1  categories  2041